// Условия (if, else if, else)

package main

import "fmt"

func main() {
	var age int
	fmt.Printf("Тебе лет сколько? ")
	fmt.Scan(&age)

	if age >= 18 {
		fmt.Println("фу, ты взрослый")
	} else if age >= 13 {
		fmt.Println("подросток")
	} else {
		fmt.Println("молодой")
	}
}

/*

== — равно (два знака равно! Один = — это создание или перезапись значения).

!= — не равно.

>, < — больше, меньше.

>=, <= — больше или равно, меньше или равно.

&& — логическое И (оба условия должны быть истинными).

|| — логическое ИЛИ (хотя бы одно условие должно быть истинным).

*/
