// Ввод данных (Scan) и красивый вывод (Printf)

package main

import "fmt"

func main() {
	var name string // она пустая, позже будем дописывать

	fmt.Print("Как тебя зовут? ") // Спрашиваем имя
	fmt.Scan(&name) // записали, & — он указывает адрес коробки в памяти, куда программа должна положить твой ответ.

	fmt.Println("Привет,", name, "!") // ВЫводим имя

	age := 20
	fmt.Printf("Мне исполнилось %d лет!\n", age)
	/*
	
	%s — вставить строку (string)

	%d — вставить целое число (int)

	\n — перенос строки в конце
	*/
}

