// Переменные, константы и типы данных

package main

import "fmt"

/*

string — любая текстовая строка. Всегда берется в двойные кавычки: "Arch", "Привет".

int — целое число (как положительное, так и отрицательное): 10, -5, 2026.

float64 — дробное число (через точку): 3.14, 99.9, -0.5.

bool — логический тип (булевый). Принимает всего два значения: true (правда / да) или false (ложь / нет).

*/

func main() {
	var word string = "hello"
	fmt.Println(word)

	var members int
	members = 20
	fmt.Println(members)

	love := "alive" // := сам понимает тип по значению справа (работает ток в функциях, ток при создании)
	fmt.Println(love)

	score := 10 // Создали переменную и положили 10
	score = 25  // Поменяли значение на 25 (если написать score := 25, будет ошибка!)
	fmt.Println(score)

	const max = 10 // значение не изменить никак
	fmt.Println(max) 
}
