/*

для создания проекта надо в консоль написать go mod init <имя проекта>

*/
package main

import "fmt" // как говорит на уроке это сокращение от format. она обязательна, так как без нее программа не умеет ни читать, ни писать в консоль. да я думаю во всех проектах она нужна

func main() { // запуск программы -- main обязательно, запуск программы
	fmt.Println("Hello World!") // вывод в консоль. println - print line выводит в консоль и делает перенос строки. print - просто выводит в консоль без переноса строки
}

/*

запуск go run <название>
для бинарника нужно
go build <название>
./<название>  -- запуск бинарника

*/
