/* 
### Задача к Уроку 2: «Апгрейд сервера»

Напиши программу, которая хранит характеристики ПК, выводит их, а затем «обновляет» железо и выводит снова.

**Условия:**

1. Создай **константу** с названием процессора (например, `"AMD Ryzen"`).
2. Создай **три переменные** разных типов (используй как минимум два разных способа объявления из урока):
* количество гигабайт оперативки (целое число, например, `16`);
* температура процессора (дробное число, например, `45.5`);
* статус разгона / турбо-буста (булево значение — выключен).


3. Выведи в терминал все 4 значения в одной или нескольких строчках (это будет состояние «До апгрейда»).
4. Затем **измени** значения всех трех переменных: увеличь оперативку до `32`, подними температуру (например, до `62.8`) и включи турбо-буст.
5. Снова выведи обновленные данные в терминал (состояние «После апгрейда»).

*/
package main

import "fmt"

func main() {
	const name = "Max"
	var love string = "cats"
	var age int = 20
	sex := "male"

	fmt.Println("2025")
	fmt.Println("name", name)
	fmt.Println("love: ", love)
	fmt.Println("age: ", age)
	fmt.Println("sex: ", sex)

	fmt.Println("2026")
	love = "cats"
	age = 21
	sex = "male"

	fmt.Println("name", name)
	fmt.Println("love: ", love)
	fmt.Println("age: ", age)
	fmt.Println("sex: ", sex)
}
